*** Version of modules/packages
#+begin_src python :results output
import numpy as np
print(np.__version__)
#+end_src

#+RESULTS:
: 1.21.4

***** regular expressions to split

#+begin_src python :results output
import re
l = r'truc|--styléaet:chouette'
print( re.split(r'a|\|--|:', l) ) 

#+end_src

#+RESULTS:
: ['truc', 'stylé', 'et', 'chouette']

***** Removing/stripping leading/first/last/some character
#+begin_src python :results output
l = '00testttt00000'
print(l.lstrip('0'))
print(l.rstrip('0'))
print(l.strip('0'))
#+end_src

#+RESULTS:
: testttt00000
: 00testttt
: testttt

***** Joining elements of a list of str
#+begin_src python :results output
liste = ["a", "b", "c"]
print("\n".join(liste))
#+end_src

#+RESULTS:
: a
: b
: c

***** getting the argument/index of an element
#+begin_src python :results output
liste = [1,2]
print( liste.index(1))
#+end_src

#+RESULTS:
: 0

****** classic series
#+begin_src python :results output
import numpy as np
import pandas as pd

s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)
#+end_src

#+RESULTS:
: 0    1.0
: 1    3.0
: 2    5.0
: 3    NaN
: 4    6.0
: 5    8.0
: dtype: float64

****** date range
#+begin_src python :results output
import numpy as np
import pandas as pd

d = pd.date_range("20211201", periods=6, freq="D")
print(d)
#+end_src

#+RESULTS:
: DatetimeIndex(['2021-12-01', '2021-12-02', '2021-12-03', '2021-12-04',
:                '2021-12-05', '2021-12-06'],
:               dtype='datetime64[ns]', freq='D')

******* with a numpy array
you can "tag" (name) the rows with "index", and the columns with
"columns"
#+begin_src python :results output
import numpy as np
import pandas as pd

dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
print(df)
#+end_src

#+RESULTS:
:                    A         B         C         D
: 2013-01-01  0.208522  0.860985  0.267739  0.193295
: 2013-01-02 -1.404824  1.352148  0.363108  0.527761
: 2013-01-03  1.314285 -0.668147 -1.235518 -0.147598
: 2013-01-04 -0.661288  2.069289  1.177938  0.229748
: 2013-01-05 -0.974901  1.062613  0.685958 -0.978787
: 2013-01-06 -1.679077 -1.182110  1.857067 -0.713573
******* with a dictionnary
if you have a dictionnary with data that is series like:
#+begin_src python :results output
d ={"A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo"}
#+end_src
meaning that the values of a key are all the same type,

then you can create a dataframe with it, your *series (values of one
key)* will be *the columns*

#+begin_src python :results output
import numpy as np
import pandas as pd

df = pd.DataFrame({"A": 1.0,
                   "B": pd.Timestamp("20130102"),
                   "C": pd.Series(1, index=list(range(4)), dtype="float32"),
                   "D": np.array([3] * 4, dtype="int32"),
                   "E": pd.Categorical(["test", "train", "test", "train"]),
                   "F": "foo"})
print(df)
#+end_src

#+RESULTS:
:      A          B    C  D      E    F
: 0  1.0 2013-01-02  1.0  3   test  foo
: 1  1.0 2013-01-02  1.0  3  train  foo
: 2  1.0 2013-01-02  1.0  3   test  foo
: 3  1.0 2013-01-02  1.0  3  train  foo

******* adding a column to a df
Setting a new column automatically aligns the data by the indexes.
#+begin_src python :results output
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randn(4, 3),
                   index=list('abcd'),
                   columns=list('ABC'))

print(df)

s1 = pd.Series([1,2,4,3],
               index=list('abdc'))
df['D'] = s1
print(df)
#+end_src

#+RESULTS:
#+begin_example
          A         B         C
a  0.193567  1.192956  0.511580
b  1.428451  0.291447 -2.245663
c  0.292541  0.660127  0.506712
d  0.670781 -0.421005 -1.396154
          A         B         C  D
a  0.193567  1.192956  0.511580  1
b  1.428451  0.291447 -2.245663  2
c  0.292541  0.660127  0.506712  3
d  0.670781 -0.421005 -1.396154  4
#+end_example

******** masks, slicing with boolean
********* with loc
(NA values in a boolean array propagate as False:)
#+begin_src python :results output
import numpy as np
import pandas as pd
df1 = pd.DataFrame(np.random.randn(4, 2),
                   index=list('abcd'),
                   columns=list('AB'))

print(df1)
print(df1.loc['a'] > 0)
print(df1.loc[:, df1.loc['a'] > 0])
#+end_src

#+RESULTS:
#+begin_example
          A         B
a -0.581268 -0.425033
b -0.081686 -0.970850
c  0.154261  0.068778
d  0.414434  0.087521
A    False
B    False
Name: a, dtype: bool
Empty DataFrame
Columns: []
Index: [a, b, c, d]
0.4187318141646289
#+end_example
********* more intuitive
#+begin_src python :results output
df[df["A"] > 0]
df[df > 0]
#+end_src
********* isin() select exact matches in a column
#+begin_src python :results output
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randn(4, 3),
                   index=list('abcd'),
                   columns=list('ABC'))

df['D'] = ['one', 'two', 'one', 'four']
print(df)
print(df[df['D'].isin(['one', 'two'])])

#+end_src

#+RESULTS:
:           A         B         C     D
: a -0.999080 -2.150070  0.356084   one
: b  1.160267  0.821434  0.232759   two
: c -1.176986 -1.664059  0.234450   one
: d -2.102014  0.128647  1.666800  four
:           A         B         C    D
: a -0.999080 -2.150070  0.356084  one
: b  1.160267  0.821434  0.232759  two
: c -1.176986 -1.664059  0.234450  one

********* changing particular values
to change the positive values by multiplying them by -1
#+begin_src python :results output
df2[df2 > 0] = -df2
#+end_src
******** slicing
********* like numpy
#+begin_src python :results output
import pandas as pd
import numpy as np

dates = pd.date_range("20130101", periods=4)
df = pd.DataFrame(np.random.randn(4, 2), index=dates, columns=list("AB"))

print(df)
print("-----------")
print(df[0:1])
#+end_src

#+RESULTS:
:                    A         B
: 2013-01-01  0.147111  1.039859
: 2013-01-02 -0.054329  0.456417
: 2013-01-03  0.352620  0.124670
: 2013-01-04  0.874506 -0.254907
: -----------
:                    A         B
: 2013-01-01  0.147111  1.039859

********* with .loc
you can also use the index and columns, and kinda like numpy
*both endpoints* are *included*
#+begin_src python :results output
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randn(6, 4),
                   index=list('abcdef'),
                   columns=list('ABCD'))
print(df1)
print(df1.loc[['a', 'd'], :])
print("only A")
print(df1.loc['d':, 'A'])
#+end_src

#+RESULTS:
#+begin_example
          A         B         C         D
a  0.537093 -0.102838 -0.434069 -0.021402
b  1.056246 -0.748348  0.392317  0.996767
c -0.451420  0.994168 -1.256889 -0.025011
d  0.778027 -1.447381  2.389844 -0.150592
e -0.182324  0.638212 -0.676576  0.639734
f -0.588683  0.605183  0.427892  1.274875
          A         B         C         D
a  0.537093 -0.102838 -0.434069 -0.021402
d  0.778027 -1.447381  2.389844 -0.150592
only A
d    0.778027
e   -0.182324
f   -0.588683
Name: A, dtype: float64
#+end_example

********* with .iloc
it's like numpy, using the position of passed integers
#+begin_src python :results output
# fourth row
df.iloc[3]
# 3-4 rows, 0-1 columns
df.iloc[3:5, 0:2]
# with list of int
df.iloc[[1, 2, 4], [0, 2]]
#+end_src
******** more complex slicing/filtering
:PROPERTIES:
:keywords: complex customized boolean mask pandas
:END:
[[https://pandas.pydata.org/docs/user_guide/indexing.html#boolean-indexing][boolean indexing guide page]]
List comprehensions and the map method of Series can also be used to
produce more complex criteria for boolean masks:
#+begin_src python :results output
import pandas as pd
import numpy as np
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
                    'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
                    'c': np.random.randn(7)})



# only want 'two' or 'three'
criterion = df2['a'].map(lambda x: x.startswith('t'))

print(df2)
print('---------')
print(df2[criterion])
#+end_src

#+RESULTS:
#+begin_example
       a  b         c
0    one  x -0.279617
1    one  y -1.153427
2    two  y  0.548806
3  three  x -0.581544
4    two  y -1.197354
5    one  x -0.137980
6    six  x -1.632937
---------
       a  b         c
2    two  y  0.548806
3  three  x -0.581544
4    two  y -1.197354
#+end_example

******** groupby
good source:
https://appdividend.com/2020/06/02/pandas-dataframe-groupby-method-in-python/
********* groupby
it returns iterators: group name and group dataframe/series
#+begin_src python :results output
import pandas as pd

dataset = {
    'Name': ['Rohit', 'Arun', 'Sohit', 'Arun', 'Shubh'],
    'Roll no': ['01', '02', '03', '04', '05'],
    'maths': ['93', '63', '74', '94', '83'],
    'science': ['88', '55', '66', '94', '35'],
    'english': ['93', '74', '84', '92', '87']}

df = pd.DataFrame(dataset)
by_name = df.groupby(['Name'])

for Name, maths in by_name:
    print(f"First 2 entries for {Name!r}")
    print("------------------------")
    print(maths.head(2), end="\n\n")
#+end_src

#+RESULTS:
#+begin_example
First 2 entries for 'Arun'
------------------------
   Name Roll no maths science english
1  Arun      02    63      55      74
3  Arun      04    94      94      92

First 2 entries for 'Rohit'
------------------------
    Name Roll no maths science english
0  Rohit      01    93      88      93

First 2 entries for 'Shubh'
------------------------
    Name Roll no maths science english
4  Shubh      05    83      35      87

First 2 entries for 'Sohit'
------------------------
    Name Roll no maths science english
2  Sohit      03    74      66      84

#+end_example

********* getting the values of a group

***** defining a class
 convention:
 capital letter for classes, and nothing else
 #+begin_src python :results output :session
 class Planet():
     def __init__(self):
         self.x = 3
         self.y = 4
     def getx(self):
         return self.x

 class Person():
     def __init__(self, name, age):
         self.name = name
         self.age = age

 earth = Planet()
 print(earth.getx())
 # you can also: but it's not a good habit (explanation after)
 print(earth.x)
 #+end_src

 #+RESULTS:
 : 3
 : 3

 generally, you want to have functions giving the client (the dude
 printing print(earth.getx())) the information he wants, and not having
 the client fetch directly in your variables

****** example with == + * / ...
example:
str len in ect... make them work for your class
print(object_of_your_class)
#+begin_src python :results output
class Planet():
    def __init__(self, x=0, y=0):
        self.x = x
        self.y = y
    def getx(self):
        return self.x
    def __str__(self):
        return f"x:{self.x}\ny:{self.y}"
    # Planet1 == Planet2
    def __eq__(self, other):
        return self.x == other.x and self.y == other.y
    # Planet1 + Planet2
    def __add__(self, other):
        return Point(self.x + other.x, self.y + other.y)
    # Planet1 - Planet2
    def __sub__(self, other):
        return Point(self.x + other.x, self.y + other.y)
    # Planet1 * Planet2
    def __mul__(self, other):
        return self.x * other.x + self.y * other.y
    # Planet1 > Planet2
    def __gt__(self, other):  # greater than
        return self.length() > other.length()
    # Planet1 >= Planet2
    def __ge__(self, other):  # greater than or equal to
        return self.length() >= other.length()
    # Planet1 < Planet2        
    def __lt__(self, other):  # less than
        return self.length() < other.length()
    # Planet1 <= Planet2
    def __le__(self, other):  # less than or equal to
        return self.length() <= other.length()
    
my_planet = Planet()
print(my_planet)
#+end_src

#+RESULTS:
: x:3
: y:4

****** example with Object[key]
[[https://stackoverflow.com/questions/33881694/overloading-the-operator-in-python-class-to-refer-to-a-numpy-array-data-membe][source]]
#+begin_src python :results output
import numpy as np

class MyArray():
    def __init__(self):
        self.data = np.zeros(10)

    def __getitem__(self, key):
        return self.data[key]

    def __setitem__(self, key, value):
        self.data[key] = value

    def __repr__(self):
        return 'MyArray({})'.format(self.data)


a = MyArray()

print(a[9])
print(a[1:5])
a[:] = np.arange(10)
print(a)
#+end_src

#+RESULTS:
: 0.0
: [0. 0. 0. 0.]
: MyArray([0. 1. 2. 3. 4. 5. 6. 7. 8. 9.])

